[
    {
        "role":"AWS Solutions Architect",
        "company":"Cloud Gurus Direct / Upwork - Freelance",
        "summary":"Responsible for building and integration of computer systems and information for meeting specific needs. Involving the integration of hardware and software for meeting the customer- defined purpose. Translate the technical requirements of a project into an architecture and design ideal for the final product. Reducing the gap between between complex problems and solutions.",
        "range":"August 2019 - Present"
    },
    {
        "role":"Web Editor",
        "company":"Code for Tallahassee, Part of Code for America Brigade",
        "summary":"This is an ongoing voluntary position to assist the local government and to polish my skills.",
        "range":"February 2019 - Present"
    },
    {
        "role":"Founder",
        "company":"P.E.O.P.L.E. Unleashed",
        "summary":"Rise Up - Impact - Explore.  To heal the earth and bring global community back to the planet.  Building sustainable villages by the means of Permaculture - Permaculture is about designing sustainable human settlements. It is a philosophy and an approach to land use which weaves together micro-climate, annual and perennial plants, animals, soils, water management, and human needs into intricately connected productive communities.  (P.E.O.P.L.E.) Passion. Encourage. Opportunity. Power. Love. Energy.  'Our success is contingent upon the highest moral idea -the greatest good to the greatest number-  Aspiration, desire, and harmonious relations, constantly and persistently maintained, will accomplish results. Well-Being comes from Well-Doing'. ~ Charles F. Haanel",
        "range":"July 2016 - Present"
    },
    {
        "role":"Route Sales Representative (RSR)",
        "company":"PepsiCo (Frito Lay)",
        "summary":"Sold and Merchandised Frito-Lay's complete line of quality products to existing and new accounts while driving a Frito-Lay truck.  \n- DOT medical certification and training \n- Accurate ordering for the customers’ needs and projected sales \n- Safe transport of merchandise to be delivered to customers \n- Customer invoicing and payment\n- Inventory of warehouse, truck and backroom grocery\n- Recorded and maintained sales/delivery information in handheld\n- Collected money from cash paying customers\n- Solicited existing customers for promotional displays and additional products\n- Maintained warehouse\n- Acquired new accounts\n- Coordinated promotional actiiities and built displays\n- Monitored and collected delinquent accounts",
        "range":"June 2013 - July 2016"
    },
    {
        "role":"CEO/Director, Marketing and Business Development/Residential Team Director",
        "company":"PM2T Inc.",
        "summary":"PM2T approaches residential dwellings with an innovative combination of Property Management and Preventive Maintenance services. By combining monthly preventive maintenance into our administrations, PM2T provides a single point of service for our customers to electronically view and contact their dedicated property service provider. Our job, simply, is to worry about the home. PM2T also offers preventive maintenance only services for property owners that do not require extensive administrative services, but would like monthly preventive assessments and upkeep.\n- Developed and directed overall marketing efforts, strategic planning, client development, and continuing growth in PM2T three main areas: corporate, military and government sectors. \n- Designed, implemented, and facilitated annual marketing plan. Support and facilitate development and implementation of section business/marketing plans. Planned and administer the Marketing Operations budget; supported development of regional marketing budgets .\n- Organized and implemented client relations including: Special events Supervise firm’s RFP protocol process including soliciting RFPs from desirable prospective clients and writing proposals for new business; participate in planning and presentation sessions, when assigned. \n- Oversaw business development activities including: Efforts through Business Development Associate Offer coaching for prospective client meetings, presentations, etc.\n- Worked with regional offices on designing and implementing prospecting and client contact systems. Oversaw corporate communications activities through Communications Associate including: External communications and systems, Internal communications and systems.\n- Public relations efforts, External vendors and consultants, Developed and administered marketing database including client and prospect information, mailing list applications, and access to financial reports, etc. Oversaw electronic marketing efforts including supervision of Website design and maintenance.\n- Advertise property, display signs, schedule showings and rent; sign, renew and cancel leases for home owners; institute actions to evict tenants to recover possession of premises; hire and discharge all contractors; manage premises for the period and upon the terms of lease agreement, furnish the services of renting, operation and management of premises; employ for owner and supervise all labor required for the operation and maintenance of premises; process tenant applications of prospective tenants.",
        "range":"December 2008 - February 2014"
    },
    {
        "role":"Director, Marketing and Business Development",
        "company":"DCAPS Inc.",
        "summary":"DCAPS Inc., established in 2008, delivers Training, Support and Operational Programs through Consultancy and Professional Services.  Determinative Consulting Associates and Professional Services, DCAPS Inc., is a Service Disabled Veteran Owned Small Business Concern (SDVOSBC).  DCAPS integrates and synchronizes Training, Support, and Operational requirements for our Military, Corporate, and Government clientele…GLOBALLY.\n- Developed and directed overall marketing efforts, strategic planning, client development, and continuing growth in DCAPS three main areas: corporate, military and government sectors. \n- Designed, implemented, and facilitated annual marketing plan. Support and facilitated development and implementation of section business/marketing plans .\n- Planned and administered the Marketing Operations budget; support development of regional marketing budgets. Organized and implemented client relations including: Satisfaction surveys, Development activities, Skills training, Special events.\n- Supervised firm’s RFP protocol process including soliciting RFPs from desirable prospective clients and writing proposals for new business; participated in planning and presentation sessions, when assigned.\n- Oversaw business development activities including: Efforts through Business Development Associate, Offered coaching for prospective client meetings, presentations, etc. Worked with regional offices on designing and implementing prospecting and client contact systems. \n- Oversaw corporate communications activities through Communications Associate including: External communications and systems, Internal communications and systems,  Public relations efforts, External vendors and consultants.\n- Developed and administered marketing database including client and prospect information, mailing list applications, and access to financial reports, etc.\n- Oversaw electronic marketing efforts including supervision of Web site design and maintenance.",
        "range":"December 2009 - February 2012"
    }
]
